app/controllers/kids_controller.rb

SELECT "kids".* FROM "kids" WHERE "kids"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @kidd = Kid.find(params[:id])

INSERT INTO "kids" ("name", "saying", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Mac"], ["saying", "Stranger Danger!"], ["created_at", "2020-08-23 01:29:14.990457"], ["updated_at", "2020-08-23 01:29:14.990457"]]
---
  def create
    @kid = Kid.new(kid_params)

    respond_to do |format|
      if @kid.save